// 一维数组
// 类型 名字[] = { };

//初始化

//int main()
//{
//	//不完全初始化, 后面没写的默认为 0 
//	int arr[10] = { 0,1,2,3,4,5,6 };
//	//完全初始化
//	int arr1[3] = { 0,1,2 };
//	//字符数组（不完全时后面是'\0'）
//	int ch[10] = { 'a','b','c' };
//	//字符串可以用 ""
//	int ch1[] = "KONG\0";
//	//可以不指定大小, 根据内容自动指定大小
//	int num[] = { 1,2,3 };
//	return 0;
//}

//每次在创建数组时 会在栈区上 创建一条*连续*的内存

//数组的房间 名字叫 下标（从 0 开始）

// 二维数组
// 类型 名字[] []
//         行 列

//初始化

//想存：
/* 1  2  3  4
   5  6  7  8
   9 10  11 12*/

//int main()
//{
//	int arr[3]/*行*/[4]/*列*/;
//
//	//当初始化时：
//	int num[3][4] = { 1,2,3,4,5,6,7,8,9,10,11,12 };//可直接进
//	int n[3][4] = { {2,4,6,8},{10,12},{14,16,18} };//也可分组
//	//不完全初始化时 后面自动进0
//
//	int num1[/*这个可以放空*/][4/*这个一定要写*/] = { {4,5,6,7},{1,2,3} };
//
//	return 0;
//}

//使用时也是用下标

//int main()
//{
//	int num[3][4] = { 1,2,3,4,5,6,7,8,9,10,11,12 };
//
//	//输出 二维数组的一个元素
//	printf("%2d\n", num[2][3]);
//	
//	//输出 二维数组的全部元素
//	int i = 0;
//	for (i = 0; i < 3; i++)
//	{
//		int j = 0;
//		for (j = 0; j < 4; j++)
//		{
//			printf("%2d ",num[i][j]);
//		}
//		printf("\n");
//	}
//	return 0;
//}

//创建二维数组时 会在栈区上 也会创建一条*连续*的内存

//int main()
//{
//	int arr[3][4] = { 1,2,3,4,5,6,7,8,9,10,11,12 };
//	int i = 0;
//	int j = 0;
//	for (i = 0; i < 3; i++)
//	{
//		for (j = 0; j < 4; j++)
//		{
//			printf("arr[%d][%d] = %p\n", i, j, &arr[i][j]);
//		}
//		printf("\n");
//	}
//	return 0;
//}

//数组越界 (下标超出范围) (有时候编译器不会报错)

//数组传参数给函数

//传参有两种方式
//1. 数组
//2. 指针

//冒泡排序算法 (两个相邻的元素比较)

//1. 数组方式 (但是传的是 首元素的指针)

//void bubble_sort(int arr[]/*接收(指针)*/, int sz)
//{
//	int i = 0;//下标
//	for (i = 0; i < sz - 1/*10-1=9*/; i++)
//	{
//		int j = 0;
//		for (j = 0; j < sz - 1 - i /*i 会越来越大*/; j++)
//		{
//			if(arr[j] > arr[j+1])//判断
//			{
//				//执行
//				int tmp = arr[j];
//				arr[j] = arr[j + 1];
//				arr[j + 1] = tmp;
//			}
//		}
//	}
//}
//int main()
//{
//	int arr[] = { 8,2,4,5,6,7,9,2,10,5,10,500,5842,4015,136,4810 };//初始化
//	int sz = sizeof(arr) / sizeof(arr[0]);//大小
//	bubble_sort(arr,sz);//传参
//	int i = 0;
//	for(i = 0;i<sz ; i++)
//	{
//		printf("%d ", arr[i]);//输出
//	}
//	return 0;
//}

//数组名 能表示首元素地址 有两个例外：
//1. sizeof(数组名) 这里表示 整个数组
//2. &数组名，取出的是整个数组的地址

//二维数组 的首元素的地址是 第一行

//int main()
//{
//	int arr[3][4] = { 0 };
//	printf("%p\n%p\n", arr, arr + 1);
//	return 0;
//}
