/* Operator */

// % - two side must int type

// 整数有 3 个二进制表示法

// 1. 原码
// 2. 反码
// 3. 补码
// 正整数 原码，反码，补码 都一样
// 负整数 原码，反码，补码 都要计算
// 
// 7 是正整数 7(十进制) --> 00000000000000000000000000000111(二进制)
// 原码的符号位就是最前面的, 如果是0 就是正，如果是1 就是负
// 原码 - 00000000000000000000000000000111 
// 反码 - 00000000000000000000000000000111
// 补码 - 00000000000000000000000000000111
// 
// 如 -7
// 原码 - 10000000000000000000000000000111
// 反码 - 11111111111111111111111111111000 (原码的符号位不变，其他从1 -> 0, 0 -> 1)
// 补码 - 11111111111111111111111111111001 (补码就是反码 + 1)
// 补码变原码 补码 -1 然后 0 -> 1, 1 -> 0
// 
// 整数在内存中存的是 *补码*

// 移位操作符 (支持 *整形* 而已)
// 移动的是 二进制位
// << , >>
// 移位操作符，移动的是存在内存中的 *补码*
// 位移必须是 *正整数*

// 左移操作符 <<

// << — 左边丢弃，右边补零 (<< 有 *2 的效果)
//int main()
//{
//	int a = 7;
//	int b = a << 1;
//	printf("a = %d\nb = %d\n", a, b);
//	return 0;
//}

// 右移操作符 >>

// 有两种方法
// 1. 算术移位 - 右边丢弃，左边补原符号位 0 / 1
// 2. 逻辑移位 - 右边丢弃，左边补 0

//int main()
//{
//	int a = -7;
//	int b = a >> 1;
//	printf("a = %d\nb = %d\n", a, b);
//	return 0;
//}

// 位操作符

// 1. & - 按位与 - 两个 补码 位对位比较 只要有 0, 那位就是 0, 两个同时是 1, 那位才是 1
// 2. | - 按位或 - 两个 补码 位对位比较 只要有 1, 那位就是 1, 两个同时是 0, 那位才是 0
// 3. ^ - 按位异或 - 两个 补码 位对位比较 不相同 = 1, 相同 = 0
// 都是 二进制
// 
// %d 打印一个有符号的整数

//int main()
//{
//	int a = 3;
//	int b = -5;
//	// 10000000000000000000000000000101 - -5 的原码
//	// 11111111111111111111111111111010 - -5 的反码
//	// 11111111111111111111111111111011 - -5 的补码
//	// 00000000000000000000000000000011 - 3 的补码
//	int c = a & b;
//	int d = a | b;
//	int e = a ^ b;
//	printf("c=%d\nd=%d\ne=%d\n", c, d, e);
//	return 0;
//}

// 交换两个变量 但是不能创建临时变量

//int main()
//{
//	int a = 10;
//	int b = -20;
//	//a = a + b;
//	//b = a - b;
//	//a = a - b;
//	//printf("a = %d\nb = %d\n", a, b); (会有溢出的问题)
//	printf("Before :\na = %d\nb = %d\n", a, b);
//	a = a ^ b;// a = 10 ^ -20
//	b = a ^ b;// b = 10 ^ -20 ^ -20 -> 10 ^ 0 -> 10
//	a = a ^ b;// a = 10 ^ -20 ^b -> 10 ^ -20 ^ 10 -> 10 ^ 10 ^ -20 -> -20
//	printf("After :\na = %d\nb = %d\n", a, b);
//	return 0;
//}

// n &= (n-1)
// if n = 15
// 1111 n
//		&
// 1110 n-1
//		=
// 1110 n
//		&
// 1101 n - 1
//		=
// 1100 n
//  ...
// 计算 一个数 的二进制 1 的个数
//int main()
//{
//	int i = 0;
//	scanf("%d", &i);
//	int count = 0;
//	while (i)
//	{
//		i &= (i - 1);
//		count++;
//	}
//	printf("%d", count);
//	return 0;
//}

// 异或 ^ 特点

//int main()
//{
//	int m = 0;
//	int n = 0;
//	scanf("%d %d", &m, &n);
//	int count = 0;
//	int ret = m ^ n;
//	while (ret)
//	{
//		ret &= (ret - 1);
//		count++;
//	}
//	printf("%d\n", count);
//	return 0;
//}

// a ^ b = c == a ^ c = b
// 
// a ^ a = 0
// 0 ^ a = a

// 求补码 在二进制中的 1 个数

//int main()
//{
//	int a = 3;
//	scanf("%d", &a);
//	int i = 32;
//	int count = 0;
//	for (i = 0; i < 32; i++)
//	{
//		int d = a & 1;
//		if (d == 1)
//			count++;
//		a = a >> 1;
//	}
//	printf("count=%d\n", count);
//	return 0;
//}

// 赋值操作符 ( = ) (创建好才能赋值)

// 连续赋值
//int main()
//{
//	int a = 0;
//	int b = 20;
//	int x = 50;
//	a = b = x / 5;
//	printf("a = %d\n", a);
//	return 0;
//}

// 复合赋值符
// 1. += -= *= /= %=
// 2. >>= <<= (左/右移 多少位)
// 3. &= |= ^=

// 判断 ( == )

// !(真) -> 真就变成假, 假变真

// ~ 按位取反 (0->1,1->0)

//int main()
//{
//	int a = 0;
//	// 00000000000000000000000000000000 - 0 的补码
//	// 11111111111111111111111111111111 - ~0 的补码
//	// 11111111111111111111111111111110 - ~0 的反码
//	// 10000000000000000000000000000001 - ~0 的原码
//	printf("%d\n", ~a);
//	int b = 56;
//	// 00000000000000000000000000111000 - 56 的补码
//	// 11111111111111111111111111000111 - ~56 的补码
//	// 10000000000000000000000000111001 - ~56 的原码
//	printf("%d\n", ~b);
//	return 0;
//}

// 用法

//int main()
//{
//	int a = 13;
//	// 00000000000000000000000000001101 - 13 补码
//	// 我想在最后第5位的0->1
//	// 00000000000000000000000000011101
//	a |= (1 << 4);
//	// 00000000000000000000000000000001 - 1 补码
//	// 00000000000000000000000000010000 - (1 << 4) 补码
//	printf("%d\n", a);
//	// 我想变回去
//	// 00000000000000000000000000011101
//	// 11111111111111111111111111101111 & 回他就ok
//	// 00000000000000000000000000010000 - (1 << 4) 补码
//	// 11111111111111111111111111101111 - ~(1 << 4) 补码
//	a &= ~(1 << 4);
//	printf("%d\n", a);
//	return 0;
//}

// ++ -- (前置, 后置)

//int main()
//{
//	int a = 3;
//	int b = ++a;// 前置++, 先++后使用 a=a+1, b=a
//	printf("%d\n", a);
//	printf("%d\n", b);
//	int c = 3;
//	int d = c++;// 后置++, 先使用后++ d=c, c=c+1
//	printf("%d\n", c);
//	printf("%d\n", d);
//	return 0;
//}

// * (指针)去找原本他存的对象

//int main()
//{
//	int a = 10;
//	int* p = &a;// 把 a 存起来
//	*p = 20;// 通过 p 找到 a, 来赋值 20
//	printf("%d\n", a);
//	return 0;
//}

// (类型) /*强制改变类型*/

//int main()
//{
//	int a = (int)3.14;
//	printf("%d\n", a);
//	return 0;
//}

// 关系操作符

// <, <=, >, >=, !=, ==

// 逻辑操作符

// &&(and), ||(or) {局限在整数，看重真假，真->1，假->0}

// && 左边为假，右边就不计算
// || 左边为真，右边就不计算

// 条件操作符

// 表达式1 ? 表达式2 : 表达式3
// 表达式1 为真 运行 表达式2
// 表达式1 为假 运行 表达式3

// 逗号表达式 

// 看最后表达式
// 但是前面的表达式是要进行计算的

//int main()
//{
//	int a = 10;
//	int b = 0;
//	int c = (b = a/10, a-b, a++, a+b);
//	printf("%d\n", c);
//	return 0;
//}

//下标引用符, []

//int main()
//{
//	int arr[3] = { 0 };
//	// arr[1] = 1[arr]
//	// arr[2] = *(arr+2)
//	// arr+2 是跳过 arr 的2个元素, 指向第 3 个元素
//	// *(2+arr)
// 	arr[1] = 8;
//	2[arr] = 9;
//	*(arr + 0) = 1;
//	printf("%d\n%d\n%d\n", *(arr + 0), arr[1], 2[arr]);
//	return 0;
//}

// 函数调用操作符, ()

// 函数定义
//int Add(int a, int b)
//{
//	return a + b;
//}
//int main()
//{
//	int a = 5;
//	int b = 6;
//	int sum = Add(a, b);// 函数调用, ()是 函数调用操作符
//	// Add, a, b 操作数
//	return 0;
//}

// 结构成员操作符 . ->

//struct STU
//{
//	char name[100];
//	int age;
//	double score;
//};
//void set_stu(struct STU* ps)
//{
//	// . 操作符 (空间浪费)
//	// 结构体对象 . 成员
//	/*strcpy((*ps).name, "Kong Teck Onn");
//	(*ps).age = 20;
//	(*ps).score = 100.0;*/
//
//	// -> 操作符 
//	// 结构体指针 -> 成员
//	strcpy(ps->name, "Tay Joo Wen");
//	ps->age = 22;
//	ps->score = 100.0;
//}
//void print_stu(struct STU * ps)
//{
//	printf("%s\n%d\n%lf", ps->name, ps->age, ps->score);
//}
//int main()
//{
//	struct STU s = { 0 };
//	set_stu(&s);
//	print_stu(&s);
//	return 0;
//}
